Revit 2027 API
BuiltInFailures.ElectricalFailures.SelectedElementsArePartOfOtherCircuit Property
 You have selected elements that are already part of other Circuits. They will be removed from the original Circuits and added to this one.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SelectedElementsArePartOfOtherCircuit { get; }
Public Shared ReadOnly Property SelectedElementsArePartOfOtherCircuit As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SelectedElementsArePartOfOtherCircuit {
	FailureDefinitionId^ get ();
}
static member SelectedElementsArePartOfOtherCircuit : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace